In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={'Names':['Ramesh','Suresh',np.nan,'Mahesh'],
      'Age':[31,32,33,np.nan],
      'City':[np.nan,'Hyd','Mumbai','Chennai']}

In [9]:
data1=pd.DataFrame(dict1)

In [10]:
data1.isnull()

   Names    Age   City
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [11]:
data1.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [12]:
data1.isnull().sum()/len(data1)

Names    0.25
Age      0.25
City     0.25
dtype: float64

In [13]:
data1.isnull().sum()*100/len(data1)

Names    25.0
Age      25.0
City     25.0
dtype: float64

In [15]:
dict2={'Names':['Ramesh','Suresh',None,'Mahesh'],
      'Age':[31,32,33,None],
      'City':[None,'Hyd','Mumbai','Chennai']}
pd.DataFrame(dict2)

    Names   Age     City
0  Ramesh  31.0     None
1  Suresh  32.0      Hyd
2    None  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [17]:
data2=pd.DataFrame(dict2)

In [18]:
data2.isnull()

   Names    Age   City
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [19]:
data2.isnull().sum()

Names    1
Age      1
City     1
dtype: int64

In [21]:
dict3={'Names':['Ramesh','Suresh','Null','Mahesh'],
      'Age':[31,32,33,'Null'],
      'City':['Null','Hyd','Mumbai','Chennai']}
pd.DataFrame(dict3)

    Names   Age     City
0  Ramesh    31     Null
1  Suresh    32      Hyd
2    Null    33   Mumbai
3  Mahesh  Null  Chennai

In [22]:
data3=pd.DataFrame(dict3)

In [23]:
data2.isnull()

   Names    Age   City
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

**Method-1**

- Fill the missing values with random number
- dataframe name=data1
- method name:fillna

In [24]:
data1.fillna(40)

    Names   Age     City
0  Ramesh  31.0       40
1  Suresh  32.0      Hyd
2      40  33.0   Mumbai
3  Mahesh  40.0  Chennai

$method-2$

In [26]:
data1['Names'].fillna('Sathish')

0     Ramesh
1     Suresh
2    Sathish
3     Mahesh
Name: Names, dtype: object

In [27]:
data1['Names'].fillna('Sathish',inplace=True)
data1

     Names   Age     City
0   Ramesh  31.0      NaN
1   Suresh  32.0      Hyd
2  Sathish  33.0   Mumbai
3   Mahesh   NaN  Chennai

In [28]:
dict1={'Names':['Ramesh','Suresh',np.nan,'Mahesh'],
      'Age':[31,32,33,np.nan],
      'City':[np.nan,'Hyd','Mumbai','Chennai']}
data1=pd.DataFrame(dict1)

**method-3**

- bfill
- ffill
- pad
- backfill

In [29]:
data1.fillna(method='backfill')
# names index 2 is missed value 
# it will replace by index 3 value
# age index 3 is missed value
# we dont have index 4,so the value is NaN
# CITY index 0 has missed value
# it replace with index value

    Names   Age     City
0  Ramesh  31.0      Hyd
1  Suresh  32.0      Hyd
2  Mahesh  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [30]:
data1.fillna(method='ffill')

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2  Suresh  33.0   Mumbai
3  Mahesh  33.0  Chennai

In [31]:
data1.fillna(method='pad')

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2  Suresh  33.0   Mumbai
3  Mahesh  33.0  Chennai

**Method-4**

**Mean**

**Median**

**Mode**

In [33]:
age_mean=data1['Age'].mean()
age_mean

32.0

In [34]:
data1['Age'].fillna(age_mean)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

In [ ]:
# insted of providing random number 
# we are filling with mean of the data

In [35]:
age_median=data1['Age'].median()
age_median

32.0

In [38]:
data1['Age'].fillna(age_median)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

In [39]:
data1['Age'].fillna(age_mode)

0    31.0
1    32.0
2    33.0
3     NaN
Name: Age, dtype: float64

In [40]:
age_mode=data1['Age'].mode()
age_mode

0    31.0
1    32.0
2    33.0
Name: Age, dtype: float64

In [ ]:
# level1:Mean Median mode
# level2:bfill fill
# level3:

**KNN imputer**

KNN: K nearest neighbour
- in the KNN imputer instead of taking mean of all the values 
- will choose  neighbors the data 
- will take those mean only

**Method-5**

**KNN imputers**

- n_neighbor is parameter can choose by user
- if we dont choose by default it will takes as=5

In [47]:
from sklearn.impute import KNNImputer
knn=KNNImputer(n_neighbors=2)
knn.fit_transform(data1[['Age']])

array([[31.],
       [32.],
       [33.],
       [32.]])

In [48]:
data1

    Names   Age     City
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

**method-6**

- based on other columns
- some times all above methods will not provide good justification
- at that times we need to check other columns dependancy also
- most of the time will pick a column which have highest correlation

In [37]:
age_mode=data1['Age'].mode()
age_mode

0    31.0
1    32.0
2    33.0
Name: Age, dtype: float64